---
kind: property
id: P:Autodesk.Revit.DB.FormArray.IsEmpty
source: html/57088883-f06a-fd89-3004-001f606b3ced.htm
---
# Autodesk.Revit.DB.FormArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.